[
  {
    "name": "Shogo Sakai",
    "comment": "I’m really honored to have been invited to participate in this project to celebrate KodamaSounds’ 5th anniversary.",
    "artistId": "Shogo Sakai",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "R-Man",
    "comment": "KodamaSounds means a lot to me, and I have truly enjoyed seeing it grow over the past five years. As a founder and manager of Resonant Union, I can truly relate to the struggles and challenges, as well as the victories and joys of organising a group like this. I feel it's truly a privilege to get to be part of a community like this. Thank you for having me. Here's to five more excellent years!",
    "artistId": "R-Man",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Justin Thornburgh",
    "comment": "KodamaSounds projects are always really nicely themed and there's nice variety in projects. The artists that come together to participate on these projects are great, so it's fun to be a part of it.",
    "artistId": "Justin Thornburgh",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Zohka",
    "comment": "Until today, I’ve only contributed to a single KodamaSounds project. I really like the song I made for that project, but it sounded like what you can usually expect of me. Thinking back on it, I think it lacked something fresh. The restrictions being this lax for this new project made it an interesting challenge, and I was able to go beyond my limits to make something new.",
    "artistId": "Zohka",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "MB",
    "comment": "I came to be involved with KodamaSounds via my activities with Resonant Union, as our contributing artists often participated on both groups' projects. I actually feel a bit bad since most of my conributions to KodamaSounds have been past works that I haven't found the opportunity to release independently (\"leftovers\" so to speak), and my submission for YGGDRASIL won't be any different, haha. That said, I'm truly grateful that Robin has been willing to accept and release these past compositions of mine on KodamaSounds' albums, and it's an honour to be part of such a large and growing group.",
    "artistId": "MB",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "SpiralFlip",
    "comment": "It's been fun to write some songs for KodamaSounds 👍",
    "artistId": "SpiralFlip",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Philip Saguil",
    "comment": "I've had the pleasure of contributing to one Kodama album every year since 2022. I enjoy the original composition projects the circle releases under ECLECTIC RESONANCE, and I hope to contribute to more in the future! Building up Resonant Union next to KodamaSounds, I've always viewed this group as a sister to our own. I am very happy to see them reach larger audiences as the years continue on, and can't wait to see what they become in the future.",
    "artistId": "Philip Saguil",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "YOKAI",
    "comment": "I arrived at Kodama two years ago now, but it feels like so much longer! This year has been the most important one for me, with the release of my third album under the circle. This album was even pressed and distributed in Japan! It’s a dream I’ve had for a long time, one I thought was unattainable until now but the stars aligned with the live presentation of the album for M3. One aspect I particularly appreciate about Kodama is the natural kindness of its members, a strong sense of mutual support and community that encourages you to push yourself further. Even though we compose on our own, there are always plenty of members available. Personally, I find this amazing because I love creating alone but surrounding myself with others when it’s needed. A big thank you to Kodama for everything it brings me, both creatively and personally, in my own individual growth!",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "eili",
    "comment": "I was really honored to be invited to such a special achievement. Anytime an indie studio sees success, it makes me just a little bit happier. I was glad to be a part of it.",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "v1ris",
    "comment": "The online VGM community has changed my life, and KodamaSounds is absolutely an instrumental part of that since I've started getting involved with it over the past year! There are so many wonderful people I've met through it, and it's always an honor and a privilege to have contributed to its projects, whether I'm arranging/composing, or playing violin (which you can hear me play on YGGDRASIL!)",
    "artistId": "v1ris",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "takehirotei",
    "comment": "I haven't provided much songs or remixes, but it was a fun experience to try out different things",
    "artistId": "takehirotei",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Garrrros",
    "comment": "I am grateful for the opportunity to contribute to KodamaSounds' amazing releases, and I am very impressed by the sheer amount of passion and dedication the artists involved show when it comes to producing fanworks under the label. KodamaSounds keeps on proving that it is a fabulous, precious and incredible project. Bravo!!!",
    "artistId": "Garrrros",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "LkProd",
    "comment": "Although my contributions weren't as relevant as that of the actual musicians involved with each release, it was a joy having the opportunity to work on DJ Koishi and ECLECTIC RESONANCE PARADISE, the latter being an album focused on genres I personally love. It's been really damn cool seeing the label growing more and more with each release, seeing cool names putting out fresh new bangers with each album, and getting to see some projects (including one I worked on) being physically sold in Japan is just plain surreal. Very excited to listen to what YGGDRASIL has to offer, and here's to plenty more years of #KODAMASWEEP!",
    "artistId": "LkProd",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Damare",
    "comment": "Although I'm a turbo lurker and haven't taken part in many kodama releases in recent years, I'd secretly contribute a major part of my improvement in music to the environment of kodamasounds (I am extremely fueled by envy thus being around very talented musicians and composers 300 times better than myself has lit a fire under me)",
    "artistId": null,
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "vervid!",
    "comment": "although I have been around the kodamasounds community for a while now, just the thought of me standing side-by-side with the many artists I look up to in the past feels sort of surreal. it feels sort of amazing having my works published under kodamasounds - not only it expanded my portfolio of sounds, it also achieved my dream of having one of my works featured on M3, which is something I've been keeping an eye on even BEFORE I started on my music production journey. it's been a wild ride so far, and I'm really looking forward to your future projects that I can potentially take part of!",
    "artistId": "vervid!",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Yamajet",
    "comment": "The world tree’s roots spread… Congratulations for the 5th anniversary! I’m really happy to have been invited from the other side of the world. Before I noticed, KodamaSounds became an important part of my life. Let’s keep the train going and aim for the 500th anniversary!",
    "artistId": "Yamajet",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "WujuBlade",
    "comment": "About my track, I really love composing piano tracks in my spare time. As I was practicing composing, i decided to make this song for this Anniversary and thought it was a good idea to show something really unique that I rarely make. I'm happy to show it off in this anniversary. Thank you for having me! :D",
    "artistId": "WujuBlade",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "intelligencecasino",
    "comment": "Congratulations on your 5th anniversary!!! It's been so much fun making music with you guys ^____^",
    "artistId": "intelligencecasino",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Yumi Sakata",
    "comment": "Kodama has always been the perfect place to really push my composition. Being part of the VGM arrangement scene, there's always this sense of limiting, be it genre wise, or making sure you can still hear parts of the original composition. With Kodama, even with the VGM arrangement projects, it always feels like it is encouraged to strive to push boundaries, even if it doesn't make sense. Yggdrasil, I feel, is the project that is really saying \"go wild\", and to have several artists on this project go wild is going to create something unforgettable. Happy 5th anniversary Kodama!!!",
    "artistId": "Yumi Sakata",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "KoDyMaxx",
    "comment": "We have been a part of KodamaSounds since near the beginning and we have come a long way since then. This project is a love letter to the great times making music under KodamaSounds until now and for the future. Thanks for having such a lovely community and for all those amazing opportunities. Happy 5th anniversary and to many more years to come!",
    "artistId": "KoDyMaxx",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Levc_EGM",
    "comment": "Despite considering myself as the one that is always \"out of place\" in most albums, I was invited to contribute something to this special occasion. I was given this golden opportunity to make whatever my heart desires, and what it desires the most is \"video game chaos\"... So I did just that! (I don't think this solves my own problem of feeling out of place lmao.) In general, I haven't been in the best place mentally. I wrote a whole blog about how I \"gave up\" trying to reach people with my music. And yet, getting invited cheered me up enough to make something incredible, and I think that's the best thing about working with KodamaSounds. They're a group of people who love making music of all kinds. And that love is contagious, it inspires everyone to keep making music. I think that's what matters most. So despite my own self doubt, I made something that I think is great, the coolest song I've put together so far. And I hope everyone in KodamaSounds, including myself, keep making amazing music that inspires others forever.",
    "artistId": "Levc_EGM",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "HAGANE",
    "comment": "I’ve written a lot of music over the past five years. I want to keep making music for the rest of my life, and I’d love to keep walking this path together with KodamaSounds.",
    "artistId": "HAGANE",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "MilkyChan",
    "comment": "Ever since this project started, I've been in awe of the sheer organizational power that is put on display. Putting out all of these amazing albums and bringing together so many people and their music is nothing short of impressive. I'd also like to give my personal thanks, because Kodama Albums are what got me out of terrible musical slumps which I may not have overcome by myself. Onto many more cool projects!",
    "artistId": "MilkyChan",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Tee-vee",
    "comment": "In 2020 I stumbled on a twitter post calling for musicians for a Touhou arrange compilation organized by a french community, and 5 years later I'm still here doing my silly tunes for it. Somehow it feels both like an eternity ago AND like it wasn't that long ago. Happy birthday KodamaSounds!! The output of this circle over just these few years has been crazy and it's always a pleasure to see it grow and to contribute when I can. Happy to have met many cool peeps thanks to it as well. My gratitude and apologies to Robin for bearing with my slow chronically late ass struggling with hard deadlines. insert \"I'm sorry, it will happen again\" meme. happy bappy xoxo tv",
    "artistId": "Tee-vee",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "ne_pura",
    "comment": "love me some music love me super cool music love me kodama :)",
    "artistId": "ne_pura",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Aniel",
    "comment": "I first took part in a Kodama’s project with ECLECTIC RESONANCE hollow horizons. Kodama is a really interesting label, with lots of different music that people express their own way!",
    "artistId": "Aniel",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "AIKATYPE",
    "comment": "Lots of things to say, I don't even know where to start. I wouldn't be able to type it all out. I am grateful for Kodama's existence.",
    "artistId": "AIKATYPE",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Nuchuu",
    "comment": "KodamaSounds publishes so many talented musicians, producers, alike, and it is with my whole heart I present Amaranthine to represent just a portion of KodamaSounds. I chose specifically a track I was passionate about, and one specifically I had failed to finish 5 years ago when I was much more new to music production, to bring back to life for KodamaSounds' 5th Anniversary celebration. As reference to the divine nature of the mythological YGGDRASIL, I chose to represent forms of investment into divinity within my work. I also chose to combine new and old, as KodamaSounds does itself in its albums of wide varieties of music, and albums of celebrating modern culture. KodamaSounds was one of the first consistently professional quality music publishing groups I ever contributed to, and I am very grateful for these opportunities to make what I am passionate about alongside other talented musicians. May music connect us as YGGDRASIL connects the realms.",
    "artistId": "Nuchuu",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Lollipop",
    "comment": "Five years—that's a long time, isn't it? Since becoming a member of the KodamaSounds family in 2022 (w/ Moriya Barista), I've come to appreciate that everyone here truly excels at producing great tunes and doing great things. I'm honored to have had the opportunity to feature in previous albums, and to also have my track included in this ambitious project. Like most pursuits in life, making music has had its requisite share of ups and downs—who knows if I'll still be doing this in another five years? But, like the title of my track, I'll strive first and foremost to continue to follow my heart, going wherever it goes. A myriad thanks to Fivda and the rest of the KodamaSounds staff for making all this possible, and here's to more great tunes and albums in the future!",
    "artistId": "Lollipop",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Ren",
    "comment": "I've been lucky enough to participate on three previous KodamaSounds albums (ECLECTIC RESONANCE ~Dusk~, Moriya Barista, and VANTABLACK 2), and hopefully more to come. I think the number of amazing artists who have worked on so many quality releases over the years is a testament to the work ethic and attention to detail of the KodamaSounds team. Here's to their continued success!",
    "artistId": "Ren",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "wrashi",
    "comment": "I could experience a lot of new things with Kodama’s projects! Thank you very much!",
    "artistId": "wrashi",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "HEAVYVIPER",
    "comment": "I have only contributed a few pieces to KodamaSounds projects at this point. Having started out in chiptune, I am very pleased to have been featured alongside the other spectacular artists on the \"ECLECTIC RESONANCE Memories\" albums. Having also been featured on the second \"UPRISING\" release, I can't say I feel I'm on the same level as other contributors, though the energy on display makes me want to get better! It's been wonderful to be associated with a circle that resonates such positive energy, and I'm always excited to see each new release. For YGGDRASIL, I tried not to come in with any preconception of what I should make. I did my best to sit down and let something come out. I had recently bought a Korg opsix as a hardware synth and controller, and decided to put it to work here. Almost all elements of the track, save for percussion and effects, were generated and recorded from the opsix. I usually work exclusively with softsynths, so the change of pace was invigorating! I ended up with something pretty airy, floating somewhere between techno and trance. I was expecting to make something harder if I'm honest, but perhaps I'm stuck in the clouds... I am at a point in my life where I am forced to balance my creative spirit with harsh realities and responsibilities. This circle has helped me maintain that balance. It's been a pleasure to contribute what I can, and I hope to do so well into the future. Happy 5th, KodamaSounds!! o(*￣▽￣*)o",
    "artistId": "HEAVYVIPER",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Eyhz",
    "comment": "It's been really great to get to know all kinds of people and producers, either just to chat with or learn from, and I'm glad I'm able to take part in these projects.",
    "artistId": "Eyhz",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "ANGELWHISPER",
    "comment": "I discovered KodamaSounds when a friend sent me a link to them asking for more arrangers for MIDNIGHT SYNDROME. This led me down the road of working on so many albums, KodamaSounds or otherwise, and I am so grateful. MIDNIGHT SYNDROME was such an amazing album to work on and it felt amazing to find my way into this community. Big thanks to Robin for her ability to somehow undertake the monumental task of organising these albums so consistently.",
    "artistId": "ANGELWHISPER",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "malicent",
    "comment": "I'm really glad I had the oportunity to participate in this amazing project. Before, I never had the chance to show what I can do to other people, wether that's producing music or helping other people for them to reach their desired sound, and KodamaSounds' project helped me to improve myself to the point I feel more confident with what I can do. Most of the time I'm behind the scene helping tracks to reach their biggest potential, but this time I'm upfront and sharing what I like to make, so I hope you enjoy it! Thank you so much for everything!!",
    "artistId": "malicent",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Yuutou",
    "comment": "I'm typically very shy when it comes to collaborating on albums that are group projects like this. I've wanted to participate more, but because of my poor memory and with how easily I get distracted, I keep forgetting. The same thing kind of happened with this song, I got invited and completely forgot until a month before it was due... (´∀｀；) I like working with KodamaSounds though. Robin is very nice and understanding, and any time I'm able to participate, I do my best to. Everyone in the circle is so incredibly skilled at what they do, and every song I hear from the others blows me away! It keeps me inspired to get even better at music, I want to reach a point where my music elicits emotions from the people that listen to it. Everyone's been wearing tougher masks lately, but I've always wanted my music to be a cushion for people to relax and listen to, if only to be themselves for a moment. I'll do my best to keep getting even better, and I hope to continue to show up in more KodamaSounds projects in the future! Happy 5th anniversary!",
    "artistId": null,
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "LibriJamm",
    "comment": "Happy 5th Anniversary. Don't really have much to say here. I'm not the sentimental type. So in short, Thanks Ms. R for reaching out and gathering everyone together all those years ago. The project's really expanded huh. So when do we get lore? There needs to be a recommended album listening order. Thanks to the people conversing in the many group chats. I don't interact much with you, but I'm glad you're having fun and creating a welcome space for others. I'm sure that by being yourselves you are making someone else very happy. And thanks to the submissions team for putting up with me submitting songs on the exact due date. I swear I'm not doing this on purpose. I do start them months in advance. But it just keeps happening. ...Eto blehh",
    "artistId": "LibriJamm",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Transendium",
    "comment": "希望大家繼續多多支持KodamaSounds的專輯！<3 Hope everyone continues to support KodamaSounds' amazing album projects! <3",
    "artistId": "Transendium",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Raphtalix",
    "comment": "Congrats on the 5th anniversary of KodamaSounds! It hasn’t been that long since I joined, but I’m grateful and honored to have contributed to the projects and to be a part of KodamaSounds as a Sound Staff. I look forward to create more awesome things with KodamaSounds!",
    "artistId": "Raphtalix",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Yozu C",
    "comment": "KodamaSounds are Kingdom 👑. Filled with S-tier talented and creative Adventurers, and YGGDRASIL will be an epic adventures (I'm sure).",
    "artistId": "Yozu C",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Alkome",
    "comment": "Happy 5th Anniversary to KodamaSounds. Since YGGDRASIL allowed a free theme, I created a track in the hardcore style I've worked on the most.",
    "artistId": "Alkome",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Before The Storm",
    "comment": "Being part of the YGGDRASIL project is a great experience, and I’m thankful for the chance to contribute to KodamaSounds’ 5th anniversary. It’s always inspiring to see how music connects people from all over the world, and I’m happy to be part of this journey with so many creative minds involved.",
    "artistId": null,
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Volumetrique",
    "comment": "Hi. Volumetrique here. I'm only the messenger but I also wanted to put nice words about KodamaSounds for the 5th year anniversary. I've been introduced to KodamaSounds and Robin through a common friend, around the era of UPRISING. We became good friends, and I've tried to be helpful in many ways, on the label and as a friend. Being able to join her workforce, which radiates with passion and talent, has been a major highlight of the last couple years of mine. Here's to so much more. Vive la France. #kodamasweep",
    "artistId": "Volumetrique",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Casio Lamb",
    "comment": "Thank you so much to KodamaSounds for musical motivation. Without the opportunities they've offered, I'd have been stuck making tracks for few ears to listen to. The community Robin has built up is strong and passionate, and I am grateful to contribute to it.",
    "artistId": "Casio Lamb",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Mitomoro",
    "comment": "KodamaSounds has been extremely fun and professional to work with. I truly appreciate them giving me a home for some tunes as I come back from an extended hiatus of sorts. You can thank them directly for getting my ass back in the game because if I didn't agree to give them music I would just keep sitting on it. Much love and Respect, Mito <3",
    "artistId": "Mitomoro",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "r",
    "comment": "Thank you for inviting to the album.",
    "artistId": "r",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Monochrome",
    "comment": "I first learned about KodamaSounds in 2023 when I stumbled across a Twitter post from them. At this time, I had only a few months ago decided I wanted to pursue music composition professionally, and I was looking for communities I could contribute to, so I could build a portfolio. At the tail end of 2023, I made my first KodamaSounds appearance on Katamania!! -a Katamari tribute album-. Since then, I've gotten heavily involved in Kodama's albums. The ECLECTIC RESONANCE series in particular has been an immensely fun and valuable challenge in diversifying my portfolio and skillset, and I've greatly enjoyed maintaining a streak of appearances (up until Memories 2, so sad). Every album theme has given me new inspiration and new avenues of exploring and refining my sound, and I unquestionably would not be the musician I am today without the consistency of Kodama's projects. 2 years after my first Kodama appearance, I'm back once again to deliver a track for this 5th anniversary album. In terms of both my prowess and my career, a lot has changed in that relatively short time. I am the most confident producer I can be right now, and I have notable game composing credits to my name, which seemed a distant impossibility back in 2023. The journey to these achievements was made with KodamaSounds being a constant spotlight on my portfolio. I'm proud to be a small piece of the circle's history, enough to have the privilege of being on YGGDRASIL.",
    "artistId": "Monochrome",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Foodbot",
    "comment": "When the owner approached me to make a song for YGGDRASIL, when I can make \"anything I want\", I got so many crazy ideas that I quickly got overwhelmed... However I'm still happy with this end product, so please enjoy it if you can!!",
    "artistId": "Foodbot",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Exteria",
    "comment": "I really love the community, such friendly and talented people! Thanks so much for these compilations and opportunities during these 5 years!",
    "artistId": "Exteria",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Ludicin",
    "comment": "Actually my first time participating! I have been reached out to before to be a part of their other compilations, but I haven't been able to participate unfortunately, so I'm glad to be able to participate this time for their 5th Anniversary.",
    "artistId": null,
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "V0iD",
    "comment": "That rush when something clicks at 3 a.m. and you just know it works. Its fun working with Kodama.",
    "artistId": "V0iD",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "GOETIΛ",
    "comment": "5 Years!!!!!!!, how has it gone by so quickly? Having released Scabra Tangat Fidei at the same time as Gensokyo Party Vol. 1, I feel especially that I've grown alongside KodamaSounds, and not just in age. In terms of favourite KodamaSounds release, definitely Escapism. trance just hits differently when you need it. For this album specifically, it's my biggest project so far, with the playlist count at ~240. I like the 2nd half a lot. In relation to my experience making music over these years, I suppose I just make stuff I like, definitely improved a lot with composition, sound design, mixing, mastering, well everything really since 2020/1, and certainly a million times better than when i started at the end of 2015. Though, too often it feels like an exercise in futility.",
    "artistId": "GOETIA",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Faxyne / idosa",
    "comment": "This is my first release on KodamaSounds as Faxyne, I had previously worked under the 'idosa' moniker. Although I may not have participated to a lot of releases on the label, I'm impressed at how big it has become and I had a pleasant time making music for this compilation in a \"make whatever you want\" state of mind! Happy birthday :)))",
    "artistId": "Faxyne",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Asayami / ReeK",
    "comment": "Working with KodamaSounds is pretty fun and actually pretty engaging. even though my planning of deadlines and stuff sucks absolute donkey ****. and the fact that there are so many musicians and producers and DTMers of wide varieties of genre, makes this even more fun for someone genrefluid like me! I see KDMS as a \"hub\" or a \"center station\" of every \"sub-community\" in the DTM space. there's ALWAYS someone I know from other servers or communities I'm in. Here's to more Compilations, more singles, more chuuni, more ARF ARF, more fumos, more missed deadlines because ADHD - and most importantly: MORE FUN DTM THINGS",
    "artistId": "Asayami",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Zeth",
    "comment": "hello! i've been a part of KodamaSounds for around 2 years, mainly contributing in the form of designing the album covers that many came to enjoy and love - very happy about all the support people have given to us and our works, music and art wise! i hope that people will keep finding cool artists from our works and we will keep putting out more banger projects in the future so stay tuned! here's to many more years of KodamaSounds \\o/",
    "artistId": "Zeth",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Yanis",
    "comment": "5 years huh... I've been contributing to Kodama for the last 4 years or so, and despite my insecurities on my japanese level, I did my best to make the circle just a bit more international. Seeing a lot of new japanese artists working with us made me really happy. Spending all those years studying wasn't for nothing... is what I always think when I listen to all those wonderful songs from the japanese artists we could work with. And now I'm on the path of making my dream come true, and I hope I'll be able to be the face of Kodama in Japan! Let's keep growing and touch many more hearts 🔥",
    "artistId": "Yanis",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "krz",
    "comment": "i ❤️ nextjs",
    "artistId": "krz",
    "section": "FROM YGGDRASIL STAFF"
  },
  {
    "name": "Doggibelle",
    "comment": "I remember being gifted a copy of Gensokyo Party Vol.1 in 2020 right at the beginning of KodamaSounds. Seeing the growth of KodamaSounds over the years is mind-blowing, and I'm very proud of Robin and every artist that contributed to this. Even if I mainly work in the shadows as a web developer, I'm glad to be part of this 💖",
    "artistId": "Doggibelle",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "VIIweights",
    "comment": "perhaps there’s a chance that i'll be doing more than just webdesign for Kodama next year",
    "artistId": "VIIweights",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "NForza",
    "comment": "I'm glad to have helped with the label's reach if only a little.",
    "artistId": "NForza",
    "section": "SPECIAL THANKS"
  },
  {
    "name": "marklincadet",
    "comment": "I have had the honor to work with Robin and cal on Memories 1&2, and am extremely proud of what we accomplished on both. They are passionate about music and the people behind them moreso, which I like to think shows in the final products. We might be different as people and often vary in our opinions, but I believe that the albums turned out amazing because we dared to speak out to each other on areas to improve, and make a decision as a team by hook or by crook before moving on. Thank you Robin for reaching out two years ago to take me on this ride, to cal and your eagle eye for talent and detail, and to everyone else I've had the pleasure of working with and listening to for these two albums!",
    "artistId": "marklincadet",
    "section": "SPECIAL THANKS"
  },
  {
    "name": "Supire",
    "comment": "Congratulations on KodamaSounds’ 5th anniversary! I’ll always cheer you on. ",
    "artistId": "Supire",
    "section": "SPECIAL THANKS"
  },
  {
    "name": "KaNa",
    "comment": "Congratulations to KodamaSounds on its 5th anniversary and the release of the commemorative album \"YGGDRASIL\"! I first participated in a KodamaSounds project with the track \"Halcyon\" from ECLECTIC RESONANCE Escapism. I’m truly happy to be part of a label filled with people who are so passionate about music. I’m also looking forward to collaborating with the label again on new works in the future! ",
    "artistId": "KaNa",
    "section": "SPECIAL THANKS"
  },
  {
    "name": "Kurokotei",
    "comment": "[insert gronyan here]",
    "artistId": "Kurokotei",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Muscises",
    "comment": "I'm incredibly grateful to contribute to a doujin circle like KodamaSounds. As someone who has been trying to kickstart their music as a means to be financially sound and collaborative, it was very difficult back in 2018 since I was just in the cusp of starting to get good at writing compositions for general audiences. However, I noticed that the usual methods of advertising yourself and getting gigs was not feasible especially with the advent of COVID lock-downs so I went back to my roots and started participating in music jams for fun. I guess that's where I caught a lot of attention, and figured I would be a good fit for something. Well, that something happened with Memories being worked on and I figured it would be cool to put out a chiptune track done in MML to show that yes there are people in the West that are invested into making music in this fashion that's commonplace in Japan. From there, everything started to fall into place and now I'm part of three music circles and done collaborative efforts for people's albums or even some singles for fun. The ultimate lesson I can give to creatives is to never be afraid of venturing out to creative spaces that are new to you, and also to give respect to creatives of all backgrounds and skill levels because we look up to each other for anything that we might need help with which is key in order to progress the culture we are invested and cultivated in. There's a quote that I have given myself years ago, and it's that I always strive to be \"Unquotable, Unpredicatable, and Unsuitable\". Ironic I know, but it's up to interpretation and it's more fun that way. :D",
    "artistId": "Muscises",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Len",
    "comment": "le fishe au chocolat",
    "artistId": "Len",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Guo",
    "comment": "Very funny and happy!",
    "artistId": "Guo",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Haykira",
    "comment": "I was very flattered to have been chosen to work on the cover and visual identity of ECLECTIC RESONANCE Memories 2's pixel art. The staff was really nice and everything ended up pretty smoothly, with very interesting exchanges of ideas and feedback! I felt like I was truly working with a passionated bunch, one which was really mindful of every minute detail. It's definitely something we should do again!! I'm really proud to have been able to bake something for a KodamaSounds compilation which got a physical release!",
    "artistId": "Haykira",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Princess Sylvysprit",
    "comment": "KodamaSounds has given me the oppurtunity to work alongside many fellow awesome musicians, some which i have known for years, and some which i have had the pleasure of meeting only recently, but one thing is for certain; making music with you all is fun, and i say let's continue expressing ourselves together!",
    "artistId": "Princess Sylvysprit",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "fusoxide",
    "comment": "Congrats on KodamaSounds' fifth anniversary! So far, I have only participated in one album, ECLECTIC RESONANCE Memories - it can be difficult to find spare time and energy to participate in album projects in general. It was an honor to contribute though, and I am still proud of the track \"miami galaxy\" that I composed. KS also inspired me to start my own music circle, Technomarina! I love the idea of gathering artists together to all make great music, especially when lesser known ones are involved. Hope I can participate in more KS projects in the future!",
    "artistId": "fusoxide",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "hasu",
    "comment": "Congratulations on KodamaSounds’ 5th anniversary! Your music activities that cross borders are truly wonderful. I’m praying for your growing success and development. I’m looking forward to another project I can participate in. ",
    "artistId": "hasu",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Ray_Oh",
    "comment": "I’m looking forward to your activities that lead to your 10th anniversary. ",
    "artistId": "Ray_Oh",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "U-Ruri",
    "comment": "Congratulations on your 5th anniversary! This is U-Ruri, who participated in ECLECTIC RESONANCE Memories 2. I feel that KodamaSounds handles genres that are not often covered elsewhere, and I really like that aspect. Wishing you all the best in the years to come!",
    "artistId": "U-Ruri",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Shauno Isomura",
    "comment": "It’s not too long ago that I contributed to the ECLECTIC RESONANCE Legendaria album, but it really meant a lot to me as this was my very first original music release! It allowed me to get to know and connect with many great young composers too! KodamaSounds has so many amazing albums and composers with them and I just can't wait to hear what is in store for the near future - Congratulations for 5 years!",
    "artistId": "Shauno Isomura",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "utzbo",
    "comment": "Congratulations on KodamaSounds’ 5th anniversary! I participated in two KodamaSounds’ projects until now, but both were good experiences! Outside of those two, there’s a lot of other projects that seem interesting, so if the opportunity arises, I’d be glad to participate in those as well!",
    "artistId": "utzbo",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "DJKurara",
    "comment": "This was one big compilation, and it's been quite a while since the last time I got to collaborate on a project, which was a lot of fun. Congratulations on your 5th anniversary!",
    "artistId": "DJKurara",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "tenko",
    "comment": "KodamaSounds was my first time really being able to take part in a compilation album, and I have been and will always feel honored and grateful to have had the opportunity to do so. I hope there will be more and more opportunities to come for me to participate under KodamaSounds again. Thank you and Happy 5th Anniversary!!",
    "artistId": "tenko",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "LCS",
    "comment": "Five years already... so wild to me. It was so much fun contributing to some of the early albums, I regret not having the time to submit more. But hopefully sometime soon! It's been wonderful hearing all the amazing tracks people have put together over the years, and I'm of course excited to see what new projects are created in the next few years :)",
    "artistId": "LCS",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "MEMODEMO",
    "comment": "KodamaSounds is 5 years old! They grow up so fast :,)",
    "artistId": "MEMODEMO",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "SomeSpoonyBard",
    "comment": "As an artist, I feel I tend to stick to a small number of circles, so being invited to participate in a KodamaSounds release was a nice way to branch out from my usual comfort zone. All the administrators have been very professional with me, and available to answer any questions I had about the process. I hope to find the opportunity in the future to work with them again.",
    "artistId": "SomeSpoonyBard",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Scramel",
    "comment": "I'm really grateful to be part of KodamaSounds. I had the opportunity to meet a lot of really talented artists, take part in special projects, and overall, be able to enjoy making music related to my favourite media out there in a community that cares about the smaller indie scene. It has grown a lot since I first joined, and I hope it only continues to grow up!",
    "artistId": "Scramel",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "acrouzet",
    "comment": "I'm glad to have been invited to put my music out there with this group of talented artists. They provided good feedback and were very supportive, teaching me a couple things I'll keep in mind as I continue music making.",
    "artistId": "acrouzet",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "tom_atom",
    "comment": "Congratulations on KodamaSounds’ 5th anniversary! I contributed to ECLECTIC RESONANCE Memories 2, and it was a huge stimulus for my music composition activities. By listening to other artists’ songs, I felt like the scope of what I could express grew larger and larger. All of your projects are wonderful and really stimulating, so I’m looking forward to the next one I may be able to contribute to! Keep doing your best, I’m cheering you on from the bottom of my heart! Onward to KodamaSounds’ 10th anniversary!",
    "artistId": "tom_atom",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "g3ntlebreeze",
    "comment": "getting invited to participate in ~Dawn~ in 2021 was a very important moment for me. i primarily work on video game OSTs, but have always had trouble working on songs just for myself. it can be hard for me to feel creative/inspired/motivated when working on a original song rather than one for accompanying media. making a track for ~Dawn~ gave me confidence in my own original work, and seeing people's positive reactions to my track was so motivating! since then, working on songs for Kodama's comps is something i eagerly look forward to. i love how supportive and talented the community is. forever grateful to be part of the Kodama family :3",
    "artistId": "g3ntlebreeze",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "MegaStrike",
    "comment": "First of all, i want to say thank you to Fivda for publishing my music, but more importantly, believing my music for KodamaSounds. As a person who mostly create music for media (Video games and animations), KodamaSounds let me explore the more unique side of the music world. I can meet other musicians that create radically different genres from what i usually make. I even met some of them in real life! I will definitely continue to release more music under KodamaSounds.",
    "artistId": "MegaStrike",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "ak+q",
    "comment": "I have only released once on KodamaSounds, but the experience was very nice! The team allows for creative expression and an outlet for all kind of musical expression. I appreciate everything the team as done and all the accomplishments over the years!",
    "artistId": "ak+q",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Aethral",
    "comment": "It's been an honor to contribute to the KodamaSounds catalog and witness its amazing growth over the past five years. Congratulations, and here's to many more years of great music!",
    "artistId": "Aethral",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "SnugglyBun",
    "comment": "I only really submitted one song to this label, and tbh I wish i participated more since it seems really nice and wonderful. I just don't have the time, energy nor emotional willpower for this stuff rn... but hopefully there will be more KodamaSounds SnugglyBun music in here :3",
    "artistId": "SnugglyBun",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "jaxcheese",
    "comment": "I'm a relative newcomer to KodamaSounds but my few chances to work with them have all been joyful... it's wonderful that they take a chance on arrange projects for less-covered soundtracks, and the staff have always been kind and welcoming to me. Memories 2 is a monumental release and I'm so grateful I was encouraged to contribute. and joining my circle pxtunes with kodama and others for united tribute arrange force was a really memorable experience. thanks to the staff and all members! I wish you five more exciting years...",
    "artistId": "jaxcheese",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "LSKR",
    "comment": "Working with KodamaSounds (for PARADISE) has been a very pleasant experience. It came at a perfect time in my life when I was in the midst of change in my creative endeavours and the diversely talented crowd of KodamaSounds' roster was exactly what I needed to get back on track. Thank you for the opportunity!",
    "artistId": "LSKR",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "blobdash",
    "comment": "blorb",
    "artistId": "blobdash",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Coconami",
    "comment": "Kodama as a whole represents a lot of firsts that I went through in this journey. 1: The first large label that I contributed to (idk does Tsundere Violence count as large?). 2: The first time my name appeared in an XFD. 3: The first Touhou remix + experimental track I made. 4: The first time I actually received payment for my musical activities. 5: The first time I'm on an album with so many beloved artists of mine. 6: The first time Callio decided to grant me the green artist role in the ES server. It's quite endearing actually; Kodama as a whole hosts so many talented artists that it's really an honour to be part of it, even as a small starting point. Although I have not contributed anything to Kodama after e_4, there will definitely be albums that I can have ideas of and make something out of it. Thanks, to Robin, and to all.",
    "artistId": "Coconami",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "sdhizumi",
    "comment": "5周年おめでとうございます！コレクティブとしてのこだわりを持ったリリースに今後も期待しています。",
    "artistId": "sdhizumi",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "scythe",
    "comment": "Happy 5th Anniversary! It’s truly an honor to have been able to participate in \"Memories\" twice. I sincerely hope that KodamaSounds, where amazing composers from all over the world gather, will continue to grow and flourish even more in the future!",
    "artistId": "scythe",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Xeudo Code",
    "comment": "KodamaSounds always had the coolest project to work on with the coolest people. What's even better is that they are always open for smaller artists as well. Congratulations on 5th anniversary and I hope this goes on for much longer.",
    "artistId": "Xeudo Code",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "MetaMusic",
    "comment": "KodamaSounds is a wonderful community, and it's been an incredibly welcoming space for me to spread my wings and experiment. I've grown as a musician in many ways thanks to Kodama, and I can't wait to participate more in the future. Thanks for the (ECLECTIC RESONANCE) Memories, here's to five more years of fantastic music <3",
    "artistId": "MetaMusic",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "yeowool",
    "comment": "congratulations to KodamaSounds' 5th year anniversary! i'm honored enough so have participated in one of their releases, and the way the whole release was structured in advance, in a way i've never seen before in any other places, was impressive and fascinating to see. hope to be a part of KodamaSounds' release again someday too, until then! 🤎",
    "artistId": "yeowool",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Ko-Shan",
    "comment": "Congratulations on KodamaSounds’ 5th anniversary! Thank you for inviting me to ECLECTIC RESONANCE UPRISING 3! You’re managing everything really well and craft wonderful projects, you’re a really unique and powerful label. Keep doing your best!",
    "artistId": "Ko-Shan",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Cororo",
    "comment": "Congratulations on KodamaSounds’ 5th anniversary! Let’s make the doujin music scene even stronger together. Cheering you on from Japan! ",
    "artistId": "Cororo",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Lila Mellark",
    "comment": "I was floored at the quality of projects and their artists, 5 years sounds like a lot but it's also a very short time to have released so many high quality projects. I hope I can work with you all again!",
    "artistId": null,
    "section": "OTHER ARTISTS"
  },
  {
    "name": "sanmal",
    "comment": "Congratulations on KodamaSounds’ 5th anniversary and the release of YGGDRASIL! I made three songs with KodamaSounds until now, and it was a really pleasant experience. Especially Purity; it was the first time I challenged myself to make a trancey Track, and it’s my favorite track between those three. Let’s keep enjoying music together in the future!",
    "artistId": "sanmal",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "soothingMelody",
    "comment": "I discovered KodamaSounds through a tweet inviting people to join for their When They Cry tribute album, Fragments of Gratitude. I am still so happy I decided to take the chance, being in a community around so many like minded people, working on music together has pushed me so much as an artist and I wouldn't trade that experience for the world. It opened a lot of opportunities for me and for that I can never thank it enough. I  You are all awesome and you do incredible work, I wouldn't be half the composer I am without you.  Thank you for existing, KodamaSounds. Happy 5th Anniversary.",
    "artistId": "soothingMelody",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Miner4ever",
    "comment": "I'm really surprised to see that KodamaSounds have reached its 5th Anniversary! It really shows how fast time has gone on, as I believed that I have joined this place in its 2nd year or so. Even though I haven't participated in any events ever since Dusk/Dawn, I still listen to the albums and songs KodamaSounds artists have released, and all I can say is compared to myself, I still have a long way to go. For my experience in releasing music in Kodama... Well at least for the only two albums I released, I would say it's very straightforward. Make what you love, explore what you haven't been able to (a.k.a. getting out of your comfortzone) and use your creativity to synthesize something everyone in your community will listen to. I really want to know what the YGGDRASIL project is about, but it might be a big one...",
    "artistId": null,
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Emelia K.",
    "comment": "Happy 5th anniversary. Let the doujin music flow.",
    "artistId": "Emelia K.",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Krep",
    "comment": "It was so much fun to work as a musician for ECLECTIC RESONANCE ~Dawn~ and as a pixel artist for the ECLECTIC RESONANCE Memories album cover 💖",
    "artistId": "Krep",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Tektheist",
    "comment": "Doujin music never dies, Doujin or death!",
    "artistId": "Tektheist",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "AKA",
    "comment": "Happy 5th anniversary to KodamaSounds!!!! I had so much fun singing on \"Légendes\". The project was filled with such passion and my favorite people. Thank you for having me. To many more years and future wonderful projects ahead!",
    "artistId": "AKA",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "SJC",
    "comment": "Happy 5th Anniversary, KodamaSounds! Witnessing your journey over the past five years and seeing the circle grow into the impressive scale it is today has been truly moving. Congratulations on this milestone, and here’s to even greater heights!",
    "artistId": "SJC",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "ViRiX Dreamcore",
    "comment": "Working with KodamaSounds has given me the chance to meet and collaborate with extremely talented people. I was even introduced to new games I hadn't played. While I typically produce electronic and jazz fusion, working with this community has broadened my composition skills and musical understanding. KodamaSounds is truly something special.",
    "artistId": "ViRiX Dreamcore",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Manof",
    "comment": "Thank you so much Fivda for asking to do not one but two cover for the two Detuned Alloy albums! I hope in the near future that I will continue to be commissioned to do the illustrations for the upcoming 39845 Detuned Alloy albums. See you bye bye!",
    "artistId": "Manof",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Tater",
    "comment": "I enjoyed the production quite a bit, and I expect I'll submit to certain future releases as well. I was introduced to the KodamaSounds Memories 2 album by two people in the community, and after participating, I recognized a bunch of other artists I'm mutuals with.",
    "artistId": "Tater",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Round Wave Crusher",
    "comment": "It's been great to work with KodamaSounds. I hope we can continue to collaborate in the near future. Keep Crushing. BRRRRR!!!",
    "artistId": "Round Wave Crusher",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Nawer Rapter",
    "comment": "Even if I haven't been able to participate lately, being able to say that my debut as a music producer was with Kodama is an honor. I have yet to see another community so devoted to enjoy art and music in such a wholesome and welcoming way. It's been truly a wonder to see so many new and old artists be so free to do what they felt was right, and to be cherished for it. No for real I do some weird ass music and those people are super chill and cool ^w^.",
    "artistId": "Nawer Rapter",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Tony Astro",
    "comment": "Hi, I'm Tony! Come '26 I'll have been making chunes for 15 years. I started when I was a lil baby boy so I'm hopeful for many more years of making kickass music for more great projects. I'm fortunate to lead an eventful life through my music and I'm thankful for the fine folk at KodamaSounds having some of my sounds in Midnight Syndrome: my first Comiket release! That's wild for a guy outta Texas. They're also at least tangentially involved with my involvement in Grasshopper Manufacture's No More Heroes III which has opened up so many doors for me. That's a lot of long-winded Tony lore that there isn't enough space here to get into. Community is one of the most important things in this life, especially in the arts. I'm fortunate to have KodamaSounds make my life just that little bit richer. Happy 5 years! Hoping for many more for y'all as well. Thank you for having me.",
    "artistId": "Tony Astro",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Ulagumo",
    "comment": "Congratulations on KodamaSounds' 5th anniversary! I participated in a KodamaSounds' release before, and it made me meet new artists, both from Japan and from overseas! I'm really grateful for that, thank you very much!",
    "artistId": "Ulagumo",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Uchulups",
    "comment": "I first found out about KodamaSounds thru my sister when she told me about a Touhou arrangement album called \"Gensokyo Party Vol. 2 VANTABLACK\". She insisted that I should join, but I was very, VERY unsure about my music; I caved in anyways! The people of KodamaSounds were very welcoming! Having such a place where beginners and experienced producers alike can coexist and share their art is so valuable, and allows growth for everyone in their craft, as well as finding people who share interests and experiences. Having to work with deadlines really helped me to practice, and the feedback you get can really put things into perspective, like \"damn, my leads DO tend to have a lower volume than they should...\" The experiences I had in this circle are invaluable, can't wait to see where it goes in the next years!!",
    "artistId": "Uchulups",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "john \"joy\" tay",
    "comment": "AAAA",
    "artistId": "john joy tay",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "XH",
    "comment": "Crazy how KodamaSounds has been here for 5 years!! Despite being featured on only one compilation (ECLECTIC RESONANCE UPRISING 3) i’m still really grateful to be among other wonderful artists while recently discovering this wonderful community!! Thank you for giving opportunities like this for upcoming and inspiring artists to showcase their work! cheers <3",
    "artistId": "XH",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Hexacube",
    "comment": "I hope I can submit more music in the future. I am always looking forward for KodamaSounds👍",
    "artistId": "Hexacube",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "yadrigg",
    "comment": "Congratulations on KodamaSounds’ 5th anniversary! I contributed to ECLECTIC RESONANCE Memories 2. I hope KodamaSounds’ music, which puts a huge focus on putting emotion in their songs, will keep reaching people’s hearts!",
    "artistId": "yadrigg",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Iyouka",
    "comment": "Hi, I don't really have too much to say due to my lack of involvement on working with them but the experience was great. I get to know multiple talented people. I'm sorry if the message seems short but here I go. :D",
    "artistId": "Iyouka",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "muyu",
    "comment": "Congratulations on KodamaSounds’ 5th anniversary! Your activities, linking together the world with Japan’s doujin music culture through a lot of different genres, like Fantasy and IDM, are absolutely wonderful. I’ll keep cheering you on! ",
    "artistId": "muyu",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Sephid",
    "comment": "It was a super fun experience creating for KodamaSounds, love your wonderful label and music!",
    "artistId": "Sephid",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Oacke",
    "comment": "happy birthday KodamaSounds!! it was amazing and an honour to be part of the latest ECLECTIC RESONANCE UPRISING album. I wish y'all a beautiful and bright future! vive la musique électronique!",
    "artistId": "Oacke",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Luze",
    "comment": "Congratulations on KodamaSounds’ 5th anniversary! I had the opportunity to contribute for the first time for one of KodamaSounds’ M3-Fall 2025 projects. Music is made of a lot of elements, like theory, sensitivity… but for me, the most important thing is to “enjoy creating”. I feel like this way of thinking is also deeply rooted in KodamaSounds’ philosophy, making it a wonderful environment for artists. Language barriers exists, but there’s no such thing as borders for pieces of art. I would love to participate in one of KodamaSounds’ projects in the future if the opportunity arises again. ",
    "artistId": "Luze",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "wasi (Takamachi Walk)",
    "comment": "I can't believe it's been 5 years since we were invited to contribute Gensokyo Party Vol. 1! I'm happy to see that the compilation albums are still going stronger than ever. It's an honour to be part of KodamaSounds' journey - they'll always have my utmost respect for all the work they do in uniting doujin musicians and circles all over the world.",
    "artistId": "wasi",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "aaaa",
    "comment": "AAAA",
    "artistId": "AAAA",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "LOVEPENGUIN",
    "comment": "I'm very happy to be a part of this. Sometimes I think about all the cool things Ive gotten to do and the amazing opportunities Ive been given through chiptune and it feels surreal. I never thought I'd be in this position a decade ago (I could barely write music at the time!). Thank you so much to everyone involved!",
    "artistId": "LOVEPENGUIN",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Lifeline",
    "comment": "Thank you for an environment where even the most unconventional ideas can be welcomed with open arms, nurtured and realized. Contributing to KodamaSounds was a great learning experience.",
    "artistId": "Lifeline",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "TakuikaNinja",
    "comment": "5 years already? I've only contributed twice so far, but the chiptune representation in the Memories projects has been amazing! Here's to more brilliant music!",
    "artistId": "TakuikaNinja",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "driftsonic",
    "comment": "Over the years, I've struggled with a couple of fundamental roadblocks: Will people enjoy my music? Can it stand among my peers' music? Is there anyone passionate about this as much as I am? KodamaSounds has checked all 3 boxes for me - From planning, to communication, to effort, support, and overall passion, I cannot recommend KodamaSounds enough. Passion projects have to be just that - passionate - we're all amateurs, with different life experiences and histories. Hell, I'm a 46-year old man with a wife and 6 year-old daughter, and for the first time in a while, I was able to be a part of something special, creative outlet-wise. I enjoy being in KodamaSounds' orbit, and I'm a better fan and artist for it.",
    "artistId": "driftsonic",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Justin Shin",
    "comment": "I arranged Moriya Barista on KodamaSounds' Gensokyo Party Vol. 3!",
    "artistId": "Justin Shin",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Elegant Sister",
    "comment": "KodamaSounds makes some of the most high effort crossfade audio mix I have ever heard for albums. It was really fun making XFDs and MV for you guys. Happy 5th Anniversary!",
    "artistId": "Elegant Sister",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "aaaa",
    "comment": "AAAA",
    "artistId": "AAAA",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Rei8bit",
    "comment": "Congratulations on KodamaSounds’ 5th anniversary! I am always surprised by the amount of passion poured into each one of your albums. If there’s something I can do to help, I’d be glad to make a piece for YGGDRASIL. Thank you again!",
    "artistId": "Rei8bit",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "aaaa",
    "comment": "AAAA",
    "artistId": "AAAA",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "aaaa",
    "comment": "AAAA",
    "artistId": "AAAA",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "unizono",
    "comment": "Congratulations on KodamaSounds’ 5th anniversary! It was an honor to make charming characters designs and cover art for you. I also contributed when I was still a novice, ECLECTIC RESONANCE Legendaria feels very nostalgic to me. I’m praying for your success! ",
    "artistId": "unizono",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Hiskov",
    "comment": "It's an honor to have directed all of those crossfade videos for two years on music and design of such great artists - and that comes from some random guy making YTPMVs and Touhou shitposts. Thank you so much and happy birthday!",
    "artistId": "Hiskov",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "RummySM",
    "comment": "Happy 5th Anniversary KodamaSounds! I only collaborated recently to help with Memories 2 for the XFDs but i'm grateful for contributing to the album in the way i did. Here's to many more years.",
    "artistId": "RummySM",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Vintagestep",
    "comment": "Seeing how KodamaSounds and everyone involved strive to keep creating never gets old. I'm always in awe of what everyone achieves, and I'm sure things are just starting out. On my end, I know I've been on a long hiatus, but things are moving forward, and I can't wait to participate and collaborate with everyone here.",
    "artistId": "Vintagestep",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "robotmeadows",
    "comment": "i worked recently with KodamaSounds and i was very impressed with their level of dedication towards creating a beautiful piece of art in the form of a record. From the professional organization to the super friendly community that they have fostered, every step of the process was a joy for me!",
    "artistId": "robotmeadows",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Null Specification",
    "comment": "Congratulations on KodamaSounds’ 5th anniversary!",
    "artistId": "Null Specification",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "exnoiz",
    "comment": "Congratulations on KodamaSounds’ 5th anniversary. I came across KodamaSounds last year, when an acquaintance of mine released a song for the label. When I saw all the different projects you were challenging yourselves with, I was amazed. I still remember being really surprised when you invited me to join a project. I felt very honored. I’m looking forward to seeing your growth from the bottom of my heart.",
    "artistId": "exnoiz",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "ehm",
    "comment": "Congrats to KodamaSounds on 5 years! Grateful for the opportunities to experiment through the COUNTERFEST label! :)",
    "artistId": "ehm",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "aaaa",
    "comment": "AAAA",
    "artistId": "AAAA",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "PSYQUO",
    "comment": "Happy 5 year anniversary KodamaSounds! Personally, I felt like I've grown a lot as a composer after just 2 years of contributing. Every new album felt like a challenge to explore and make something new/different. As a whole, KodamaSounds feels like a culmination of people who are really really passionate about music in every aspect. I'm incredibly thankful to be able to share my own music through KodamaSounds, and to actually meet the people who make it possible. Here's to 5(X) more years!",
    "artistId": "PSYQUO",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Elliot Hsu",
    "comment": "This year has been crazy but I was happy to have contributed to Legendaria. While I have started working this year (and went on a short hiatus to deal with life stuff), I don't plan on ending my doujin activities anytime soon. Really appreciate the project invitations and looking forward to hearing what's next! Happy 5th Anniversary!",
    "artistId": "Elliot Hsu",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "trailmix37",
    "comment": "I've loved experiencing music for a long time - listening to it, of course, and making it. And since about 10 years ago I have loved the doujin scene for its hobbyist, grassroots passion, and its self-indulgent works that say to me, \"I made this because I wanted to make it\". So, naturally, I really love KodamaSounds and what it has done. Since coming aboard about 2 years ago it's filled my heart to see it serve as a hub for and showcase the work of a ton of artists both familiar and unfamiliar to me. Thanks to Robin and the team for being part of the lifeblood that makes the doujin scene great, and it's so meaningful to be able to participate in my own small way with my own work. I'm glad that KodamaSounds has let me be a part of it and the greater doujin scene. Though I'm not on this album in particular, I am so looking forward to it as usual. Happy 5th anniversary and happy YGGDRASIL - here's to many more years!!",
    "artistId": "trailmix37",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Tobokegao",
    "comment": "As a label that releases chiptune and game music, I feel you’ve been the most active in recent years, so I’m really happy that I was able to contribute as well!",
    "artistId": "Tobokegao",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Amir",
    "comment": "Congratulations on KodamaSounds’ 5th anniversary! I contributed to Memories 1. Through KodamaSounds, I was able to meet a lot of artists, and a lot of people listened to my music. Thank you so much! I’ll keep cheering you on! ",
    "artistId": "Amir",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "dante gofar (fabula nova)",
    "comment": "happy 5 years to KodamaSounds! I've sort of been nothing more than a floater and a straggler who kept bringing empty promises of contributing to compilations before dropping out at the last minute due to scheduling issues... but I got to make my official compilation debut eventually, before getting an even larger spotlight with the official debut single for my band \"fabula nova\". truly I could not have asked for a better opportunity and I am forever thankful to Robin and everyone else at KodamaSounds for being so supportive and for nurturing a circle and a community that breeds so much life and creativity. I hope to be able to actually do more with the circle in the following years.",
    "artistId": "dante",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "MelissaLiTian",
    "comment": "Happy 5 year anniversary! It is so amazing to have been following KodamaSounds and the participating artists, seeing the community grow and continuing to grow. I am glad that as a graphic designer I got to be part of this, and discover new music, new artists and connect with others. I cannot wait for the next five years. I wish everyone part of this a bright future ahead ♥",
    "artistId": "MelissaLiTian",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Ness",
    "comment": "Thank you for giving me the opportunity to draw a few album artworks, and congratulations to all artists that got to contribute to KodamaSounds' multiple projects. HAPPY BIRTHDAY",
    "artistId": "Ness",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Theosmeo",
    "comment": "KodamaSounds is full of so many inspired and exciting artists, and there is such a rush to seeing them discuss their passion. Everyone is so friendly and helpful to each other. Its so wonderful to see people dedicated to the minutiae of producing specific sounds when they make music that it can't help but energize me to try my best when I've worked alongside them in the past. I have really fond memories of the listening parties I made it to and the general chats people have had in the server about tunes they're passionate for.",
    "artistId": "Theosmeo",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Azure",
    "comment": "Making music is something that I enjoy putting my time and energy into. Hearing the end result and getting feedback helps me grow as an artist. This especially applies to working with the people at KodamaSounds. Happy 5th anniversary! Here's to many more!",
    "artistId": "Azure",
    "section": "OTHER ARTISTS"
  },
  {
    "name": ".noise",
    "comment": "Congratulations to KodamaSoft for their 5 year anniversary! ",
    "artistId": "dotnoise",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "MOUNTAIN",
    "comment": "It's been incredible seeing how much KodamaSounds has grown, absolutely incredible to see how many people are contributing to projects, I get genuinely starstruck seeing some of the names, and the music is amazing (I mean, that's a given)! Seeing that there have been physical releases in Japan was fantastic, and I'll be cheering everyone on (and hopefully contributing myself) in the future!",
    "artistId": "MOUNTAIN",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Rhap",
    "comment": "Congratulations on KodamaSounds' 5th anniversary! I first contributed recently, for Memories 2, but I'm really honored to be there for the 5th anniversary. I’m looking forward to future projects I can contribute to. ",
    "artistId": "Rhap",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "asuton",
    "comment": "It was a really great experience composing music for you alongside my performance activities. I'm really busy these days, so I don't have much time to compose, but I would love to make music again. I wish you continued growth and success. Keep doing your best! ",
    "artistId": "asuton",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "wauldelta",
    "comment": "I am very happy to have been able to contribute to this project through an album cover illustration, it was a great experience for me and i love to see communities making projects like yours, keep going forward ✨",
    "artistId": "wauldelta",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Nokutoka Momiji",
    "comment": "Heyo! KodamaSounds has been quite the special experience for me! Never had I ever seen such a friendly, rapidly accessible community of amazing musicians who can all come together to collaborate and make such boppin' masterpieces with ease. KodamaSounds has allowed me to create some of my best tracks yet and discover new artists, and for that I am forever thankful. I look forward to creating with them more in the future and seeing what everyone else brings to the table!",
    "artistId": "Nokutoka Momiji",
    "section": "OTHER ARTISTS"
  },
  {
    "name": "Fivda",
    "comment": "I've always lived a hectic life of art and creativity. Every few years, my tastes change greatly, and so do my projects. Years back, I don't think I could imagine myself in the position I am today. I think I can confidently say that KodamaSounds is the best thing I've ever created of my life. It's insane to me that we've gone this far, and there is no sign of stopping. It has made me meet hundreds of amazing friends and artists, and it made me learn from my mistakes and successes to grow better as a person. I am eternally thankful to all of the artists that have trusted me, and helped me make this dream a reality. I am looking forward to the future in a way I couldn't have ever imagined. Thank you! #KODAMASWEEP",
    "artistId": "Fivda",
    "section": "FINAL COMMENT"
  }
]